w2f_cylinder/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    cylinder;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
            p1 (14 0 0);
            p2 (14 1.2 0.0);
            radius 2;
        }
    }
    {
        name    cylinder;
        type    cellSet;
        action  invert;
        source  cylinderToCell;
        sourceInfo
        {
            p1 (14 0 0);
            p2 (14 1.2 0.0);
            radius 2;
        }
    }
);

// ************************************************************************* //
